export default {

	copyText(text) {
		uni.setClipboardData({
			data: text
		});
	},
	rmbDaXieZhuanHuan(n) {
		var fraction = ['角', '分'];
		var digit = ['零', '壹', '贰', '叁', '肆', '伍', '陆', '柒', '捌', '玖'];
		var unit = [
			['元', '万', '亿'],
			['', '拾', '佰', '仟']
		];
		var head = n < 0 ? '欠' : '';
		n = Math.abs(n);

		var s = '';
		//先计算小数点，后面的角，分
		for (var i = 0; i < fraction.length; i++) {
			s += (digit[Math.floor(n * 10 * Math.pow(10, i)) % 10] + fraction[i]).replace(/零./, '');
		}

		s = s || '整'; //s不存在说明是整数
		n = Math.floor(n);
		for (var i = 0; i < unit[0].length && n > 0; i++) {
			var p = '';
			for (var j = 0; j < unit[1].length && n > 0; j++) {
				p = digit[n % 10] + unit[1][j] + p;
				n = Math.floor(n / 10);
			}
			s = p.replace(/(零.)*零$/, '').replace(/^$/, '零') + unit[0][i] + s;
		}
		return head + s.replace(/(零.)*零元/, '元').replace(/(零.)+/g, '零').replace(/^整$/, '零元整');
	},
	xuankunicheng(){
		[ {
		    class: "翅膀昵称生成",
		    datalist: [ "꧁꫞꯭昵称꯭꫞꧂", "꧁༺昵称༻꧂", "꧁❀昵称❀꧂", "꧁༺༽༾ཊ昵称ཏ༿༼༻꧂", "꧁༺❀ൢ昵称ൢ❀༻꧂", "꧁༺ཌ༈昵称༈ད༻꧂", "༺ཌ༈昵称༈ད༻", "༺ཌༀൢ昵称ༀད༻", "༺ཌༀཉི昵称༃ༀད༻", "༺࿈昵称࿈༻", "༺❀ൢ昵称❀ൢ༻", "❀༒昵称༒❀", "༺༽༾ཊ昵称ཏ༿༼༻", "༺ཌ༈昵称༈ད༻", "༺昵称༻", "╰︶⋛⋋⊱๑昵称๑⊰⋌⋚︶╯", "╰︶﹉๑昵称๑﹉︶╯", "╰⋛⋋⊱⋋昵称⋌⊰⋌⋚╯", "╰⋛⋋⊱๑昵称๑⊰⋌⋚╯", "╰⊱⋛⋋昵称⋌⋚⊰╯", "⊹⊱⋛⋋昵称⋌⋚⊰⊹", "︶﹌⋛昵称⋚﹌︶", "࿐ཉི༗࿆昵称 ༗࿆ཉི࿐", "༺།༼࿄࿆昵称࿅࿆༽།༻", "௸྄ིོུ昵称คิดถ", "☜☞昵称☜☞", "⋛⊱昵称⊰⋚", "◥昵称◤", "☜昵称☞", "ε昵称з", "༺昵称༻", "ʚ昵称ɞ" ]
		}, {
		    class: "情侣个性昵称",
		    datalist: [ "✎ℳ๓昵称✾", "ัζั͡昵称ั͡ั͡ั✾", "✎ℳ₯㎕.dear昵称℡", "じ★ve゛昵称℘", "じ☆ve↘昵称う", "じòぴé↘ 昵称๓", "ζั͡ޓއއއ๓昵称€。", "✎﹏ℳ๓₯㎕❦昵称う", "Alone°昵称ご", "✐﹌℘ℳ₨、昵称๓", "ノunique丶昵称ャ", "、♡†ฅr昵称๓`♡", "♡.†ฅr̶昵称ั͡℡", "◆◇昵称╯ ", "︶￣昵称♀", "︶￣昵称♂", "╯昵称♚", "╯昵称♛" ]
		}, {
		    class: "战队公会昵称",
		    datalist: [ "丿艹巅峰丨丶昵称", "丶巛全F最嗨o灬昵称", "彡kiss丿灬昵称", "广东Win丨灬昵称", "丿A名牌货灬昵称", "昵称灬家族", "丿TK丶灬丨昵称。", "丿super丶昵称灬", "Spurt丶昵称ご", "丨Sky灬丨昵称", "丿Star丨昵称", "◥▇▇▇╋【战灬昵称", "昵称ㄣ▄︻┳═一", "◆◇昵称·вοοS", "昵称Culb°", "昵称__Home", "▄︻┳═一★昵称", "v1p丶★昵称", "◢▂昵称▂◣", "丿TK丶灬丨昵称" ]
		}, {
		    class: "个性符号昵称",
		    datalist: [ "ㄨ℉昵称℅`", "★·°昵称;︶︵︶", "?昵称ヽ。", "≒昵称/／.ら", "︶ㄣ昵称ㄣ", "─━═昵称ζ", "〆昵称ゾ", "㊣昵称㊣", "づ昵称╄→", "︻◣_昵称り~", "←￠昵称☆", "╃昵称メ", "ㄗs:昵称︶ㄣ", "╭ァ昵称℅", "圝◤昵称◥圝", "oo-┈→昵称℡~", "ゞ↘o昵称:", "﹎ゞ昵称/╱°", "￡昵称☆★", "ご昵称ミ↗", "ぺ昵称ぺ", "ヤ^昵称íΟо." ]
		} ]
	}
}
